# https://quera.org/problemset/9774
# عدد چاپ‌کن
# رنامه‌ای بنويسيد كه یک عدد صحيح را که تعداد ارقامش مشخص نيست از کاربر گرفته و هر رقم را به تعداد آن رقم چاپ کند.
# ورودی

# در یک خط عدد به شما داده می‌شود. طول عدد از ۱۰۰ کوچکتر است.
# خروجی

# به ازای هر رقم ابتدا خود آن رقم به همراه ‍: را چاپ کرده سپس به تعداد آن رقم از همان رقم چاپ کنید.
# ورودی نمونه ۱
# 50943

# خروجی نمونه ۱
# 5: 55555
# 0:
# 9: 999999999
# 4: 4444
# 3: 333


n=(input())
# اگر زمان دریافت اینتیجر دریافت شود به مشکل میخوریم چون برای تبدیل با استرنیگ صفر ابتدا را برمیدارد
# چون در اعداد صحیح صفر قبل عدد خوانده نمیشه
n_str=str(n)

for i in range(len(n_str)):
    ragham=n_str[i]
    print(f"{ragham}: {ragham * int(ragham)}")
    
