# https://quera.org/problemset/51865
# # وروز که به دلیل قرنطینه کم‌حوصله شده، می‌خواهد به سفری تفریحی برود. (او با استفاده از اپلیکیشن بانکت بلیطی برای سفر تهیه کرده است). وی با استاد خود، آقا فیروز صحبت می‌کند که از او اجازه بگیرد تا بتواند در کلاس‌های آنلاینش شرکت نکند.

# # از آن‌جایی که آقا فیروز به فکر سلامتی شاگردش است، می‌خواهد او را وادار کند تا در خانه بماند. برای این‌کار به او می‌گوید که در امتحان نمره XX گرفته است؛ ولی این شرایط برای بهبود نمره‌اش وجود دارد:

# #     در صورتی که به سفر نرود، ۲۰ می‌گیرد.
# #     اگر دقیقا هفت روز به سفر برود، همان نمره XX را می‌گیرد.
# #     در غیر این صورت به ازای هر یک روز، دقیقا یک نمره کم می‌شود (اگر نمره او کم‌تر از صفر شود، همان نمره صفر را می‌گیرد). این حالت شامل حالت‌های که نوروز بین ۱ تا ۶ روز به سفر برود هم می‌شود.

# # حال نوروز بلیط سفر خود را از بانکت خریده‌ و می‌داند که دقیقا NN روز به سفر می‌رود، اما به‌دلیل افسردگی از قرنطینه، نمره خود را حساب نمی‌کند. به او کمک کنید و بگویید چه نمره‌ای در این درس می‌گیرد.
# # ورودی

# # در خط اول عدد صحیح XX آمده‌است که بیانگر نمره فعلی نوروز در درس بهداشت و سلامت می‌باشد.
# # در خط دوم عدد صحیح NN آمده‌است که بیانگر تعداد روز‌هایی می‌باشد که نوروز می‌خواهد به سفر برود.
# # 0≤X≤20
# # 0≤X≤20
# # 0≤N≤100
# # 0≤N≤100
# # خروجی

# # در تنها خط خروجی، نمره نهایی‌ که نوروز در درس بهداشت و سلامت می‌گیرد را خروجی دهید.

############################################################################

X=int(input())
N=int(input())

if N==0:
    print("20")

elif N==7:
    print(X)

elif X - N<0:
        print("0")

else:
    print(f"{X - N} ")
