# https://quera.org/problemset/123798
# # quera1_123798
# # تیمور پسری کم‌حافظه و عاشق برنامه‌نویسی است.

# # چون حافظه‌ی بلندمدت او ضعیف است، هر سال فراموش می‌کند که مسابقات کدکاپ شروع شده است و به همین دلیل از شرکت در این مسابقات بازمی‌ماند.

# # بنابراین تصمیم می‌گیرد رباتی را به‌گونه‌ای برنامه‌ریزی کند که هر سال، قبل از شروع هر سری از مسابقات کدکاپ، آغاز آن دوره از رقابت‌ها را به او اعلام کند.

# # توضیح تصویر

# # چون تیمور حافظه‌ی ضعیفی دارد، فراموش کرده است که چگونه باید کُد بزند :/. پس وظیفه‌ی شما این است که برنامه‌ی این ربات را به‌گونه‌ای بنویسید که با گرفتن یک عدد nn، که نشان‌دهنده‌ی nnاُمین دوره از مسابقات کدکاپ است، شروع آن دوره را اعلام کند.
# # ورودی

# # در تنها خط ورودی، عدد طبیعی nn آمده است.

# # 1≤n≤100
# # 1≤n≤100
# # خروجی

# # در تنها خط خروجی، باید عبارت Hello CodeCup n! را چاپ کنید که nn برابر با همان سال برگزاری مسابقات است.
# #     به کوچکی و بزرگی حروف و فاصله‌ی بین کلمات دقت کنید.

######################################################################

n=int(input())
print(f"Hello CodeCup {n}!")